# BendDiameterNegative Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..BendDiameterNegative Property
BuiltInFailures..::..FabricFailures Class See Also
---
Fabric Bend Diameter is negative.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BendDiameterNegative { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendDiameterNegative As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BendDiameterNegative {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace